Revit 2027 API
BuiltInFailures.StairRampFailures.StairsTopLowerThanBaseFailure Property
 The top of the Stair is lower than the base of the Stair
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsTopLowerThanBaseFailure { get; }
Public Shared ReadOnly Property StairsTopLowerThanBaseFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsTopLowerThanBaseFailure {
	FailureDefinitionId^ get ();
}
static member StairsTopLowerThanBaseFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace